emacs/aeu.tex
% Created 2025-12-10 Mi 19:04
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{physics}
\usepackage{tikz}
\usepackage{listings}
\author{asdf}
\date{\today}
\title{Test Scroll}
\hypersetup{
 pdfauthor={asdf},
 pdftitle={Test Scroll},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Questions}
\label{sec:org3708b3f}
for the next chapter
  What is the shape of time?
\begin{itemize}
\item Can a mind become a manifold?
\item What structure survives collapse?
\end{itemize}
\section*{Code as incantation — Emacs Lisp}
\label{sec:org76f767d}

\begin{verbatim}
(defun shapeshift/echo-reality ()
  (message "Ink becomes geometry. Geometry becomes law."))
(shapeshift/echo-reality)
\end{verbatim}
\section*{Opening — Physics as poetry}
\label{sec:org5907920}
The first breath of structure.

\[
E = mc^2
\]

A definition as sharp as a blade:

\[
\Delta S \ge 0
\]

Entropy never sleeps.
\section*{Continuation — Geometry of thought}
\label{sec:org361fdf3}

A tensor, folded like a cathedral vault:

$\backslash$[
T\^{}\(\mu\)\textsubscript{\(\nu\)} =
\begin{pmatrix}
1 & 0 & 0 & 0 \\
0 & -1 & 0 & 0 \\
0 & 0 & -1 & 0 \\
0 & 0 & 0 & -1
\end{pmatrix}
$\backslash$]
\section*{Shell as steel}
\label{sec:org199356e}
\begin{verbatim}
echo "Awaken the forge"
uptime
\end{verbatim}
\section*{Python shaping numbers}
\label{sec:org62245e2}
\begin{verbatim}
import math
print(math.sqrt(2))
\end{verbatim}
\section*{Diagram — TikZ vector ritual}
\label{sec:org22b3cf8}
Here ink becomes geometry:

$\backslash$[
\begin{tikzpicture}
  \draw[->, thick] (0,0) -- (2,1);
  \draw[->, thick] (0,0) -- (-1,2);
  \node at (2.2,1) { $\vec{a}$ };
  \node at (-1.2,2) { $\vec{b}$ };
\end{tikzpicture}
$\backslash$]
\section*{Algorithm as scripture}
\label{sec:org4f00901}
\begin{verbatim}
\[
f(x) = 
\begin{cases}
x^2 & x \ge 0\\
-x & x < 0
\end{cases}
\]
\end{verbatim}
\section*{Axioms as stone tablets}
\label{sec:org80073c6}
\begin{quote}
What is written here is not description,
but declaration.
Reality is shaped rather than observed.
\end{quote}
\end{document}
